import streamlit as st

st.set_page_config(
    layout="wide",
    initial_sidebar_state="expanded"
)

# Текст ниже сгенерирован LLM
st.title('👋 Hello')
st.write("Добро пожаловать в приложение для предсказания цены автомобиля!")
st.markdown("---")

st.subheader('📌 О приложении')
st.write("""
Это приложение позволяет:
- Предсказывать стоимость автомобиля по его характеристикам
- Анализировать данные с помощью интерактивных графиков
- Изучать коэффициенты обученной модели

Используйте боковое меню для навигации между разделами.
""")


# Ссылка на GitHub
with st.sidebar:
    st.markdown("---")
    st.markdown("**👩‍💻 Автор:** Сморчкова Юлиана")
    st.markdown("**🔗 Подробнее на** [GitHub](https://github.com/smorchkova001-git/ML_models/tree/main)")
    st.markdown("---")
